; domain
(define (domain gripper-strips)
    (:requirements :strips :typing)
  (:types robot room ball gripper - object)
  (:predicates (at-robby ?r - robot ?ro - room)
	       (at ?b - ball ?r - room)
	       (free ?r - robot ?g - gripper)
	       (carry ?b - ball ?g - gripper))

  (:action move
	   :parameters (?r - robot ?from - room ?to - room)
	   :precondition (and (at-robby ?r ?from))
	   :effect (and (at-robby ?r ?to)
			(not (at-robby ?r ?from))))

  (:action pick
	   :parameters (?r - robot ?obj - ball ?room - room ?gripper - gripper)
	   :precondition (and (at ?obj ?room) (at-robby ?r ?room) (free ?r ?gripper))
	   :effect (and (carry ?obj ?gripper)
			(not (at ?obj ?room))
			(not (free ?r ?gripper ))))

  (:action drop
	   :parameters (?r - robot ?obj - ball ?room - room ?gripper - gripper)
	   :precondition (and (carry ?obj ?gripper) (at-robby ?r ?room))
	   :effect (and (at ?obj ?room)
			(free ?r ?gripper)
			(not (carry ?obj ?gripper)))))

; problem
(define (problem gripper-1-5-5)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 - ball)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room1)
(at ball2 room2)
(at ball3 room2)
(at ball4 room3)
(at ball5 room4)
(at ball6 room2)
(at ball7 room6)
(at ball8 room10)
(at ball9 room5)
(at ball10 room7)
)
(:goal
(and
(at ball1 room2)
(at ball2 room3)
(at ball3 room4)
(at ball4 room5)
(at ball5 room2)
(at ball6 room6)
(at ball7 room2)
(at ball8 room1)
(at ball9 room9)
(at ball10 room10)
)
)
)

; plan
1. (pick robot1 ball1 room1 rgripper1)
   deleted: (at ball1 room1) (free robot1 rgripper1)
   added: (carry ball1 rgripper1)
   goals met: 0 of 10
2. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 0 of 10
3. (pick robot1 ball6 room2 lgripper1)
   deleted: (at ball6 room2) (free robot1 lgripper1)
   added: (carry ball6 lgripper1)
   goals met: 0 of 10
4. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 1 of 10
5. (move robot1 room2 room6)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room6)
   goals met: 1 of 10
6. (drop robot1 ball6 room6 lgripper1)
   deleted: (carry ball6 lgripper1)
   added: (at ball6 room6) (free robot1 lgripper1)
   goals met: 2 of 10
7. (pick robot1 ball7 room6 rgripper1)
   deleted: (at ball7 room6) (free robot1 rgripper1)
   added: (carry ball7 rgripper1)
   goals met: 2 of 10
8. (move robot1 room6 room2)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room2)
   goals met: 2 of 10
9. (drop robot1 ball7 room2 rgripper1)
   deleted: (carry ball7 rgripper1)
   added: (at ball7 room2) (free robot1 rgripper1)
   goals met: 3 of 10
10. (pick robot1 ball3 room2 rgripper1)
   deleted: (at ball3 room2) (free robot1 rgripper1)
   added: (carry ball3 rgripper1)
   goals met: 3 of 10
11. (move robot1 room2 room4)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room4)
   goals met: 3 of 10
12. (pick robot1 ball5 room4 lgripper1)
   deleted: (at ball5 room4) (free robot1 lgripper1)
   added: (carry ball5 lgripper1)
   goals met: 3 of 10
13. (drop robot1 ball3 room4 rgripper1)
   deleted: (carry ball3 rgripper1)
   added: (at ball3 room4) (free robot1 rgripper1)
   goals met: 4 of 10
14. (move robot1 room4 room2)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room2)
   goals met: 4 of 10
15. (drop robot1 ball5 room2 lgripper1)
   deleted: (carry ball5 lgripper1)
   added: (at ball5 room2) (free robot1 lgripper1)
   goals met: 5 of 10
16. (pick robot1 ball2 room2 rgripper1)
   deleted: (at ball2 room2) (free robot1 rgripper1)
   added: (carry ball2 rgripper1)
   goals met: 5 of 10
17. (move robot1 room2 room3)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room3)
   goals met: 5 of 10
18. (pick robot1 ball4 room3 lgripper1)
   deleted: (at ball4 room3) (free robot1 lgripper1)
   added: (carry ball4 lgripper1)
   goals met: 5 of 10
19. (drop robot1 ball2 room3 rgripper1)
   deleted: (carry ball2 rgripper1)
   added: (at ball2 room3) (free robot1 rgripper1)
   goals met: 6 of 10
20. (move robot1 room3 room5)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room5)
   goals met: 6 of 10
21. (drop robot1 ball4 room5 lgripper1)
   deleted: (carry ball4 lgripper1)
   added: (at ball4 room5) (free robot1 lgripper1)
   goals met: 7 of 10
22. (pick robot1 ball9 room5 rgripper1)
   deleted: (at ball9 room5) (free robot1 rgripper1)
   added: (carry ball9 rgripper1)
   goals met: 7 of 10
23. (move robot1 room5 room9)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room9)
   goals met: 7 of 10
24. (drop robot1 ball9 room9 rgripper1)
   deleted: (carry ball9 rgripper1)
   added: (at ball9 room9) (free robot1 rgripper1)
   goals met: 8 of 10
25. (move robot1 room9 room7)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room7)
   goals met: 8 of 10
26. (pick robot1 ball10 room7 rgripper1)
   deleted: (at ball10 room7) (free robot1 rgripper1)
   added: (carry ball10 rgripper1)
   goals met: 8 of 10
27. (move robot1 room7 room10)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room10)
   goals met: 8 of 10
28. (pick robot1 ball8 room10 lgripper1)
   deleted: (at ball8 room10) (free robot1 lgripper1)
   added: (carry ball8 lgripper1)
   goals met: 8 of 10
29. (drop robot1 ball10 room10 rgripper1)
   deleted: (carry ball10 rgripper1)
   added: (at ball10 room10) (free robot1 rgripper1)
   goals met: 9 of 10
30. (move robot1 room10 room1)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room1)
   goals met: 9 of 10
31. (drop robot1 ball8 room1 lgripper1)
   deleted: (carry ball8 lgripper1)
   added: (at ball8 room1) (free robot1 lgripper1)
   goals met: 10 of 10
